import React from "react";

const ContractPaper = () => {
  return (
    <div
      className={
        "text-wrap whitespace-pre-wrap break-words overflow-scroll tablet:h-[600px] mobile:h-[242px]"
      }>
      위탁판매계약서(판매자용) [*](이하 “갑”), 주식회사 파운드오브제(이하
      “을”)는 다음과 같이 구매계약(이하 “본 계약”)을 체결한다. <br />
      제1조 [목적] 본 계약은 플라스틱 원재료의 판매∙구매와 관련하여 판매자로서
      “갑”과 구매자로서 “을” 간의 거래에 있어서 당사자 사이의 기본적인 권리와
      의무를 정하는 것을 목적으로 한다.
      <br />
      <br />
      제2조 [계약제품] “갑”과 “을”이 거래하는 제품에 대한 구체적인 사양은
      별첨1.에 의한다. 제3조 [계약기간] 본 계약은 [*]년 [*]월 [*]일로부터 [*]년
      [*]월 [*]일까지 유효하다. <br />
      제4조 [계약제품의 구매]
      <br />
      (1) “갑”은 계약제품의 위탁자(이하 “위탁자”)와 체결한 위탁판매계약에 따라
      계약제품을 판매하는 위탁매매인에 해당한다. <br />
      (2) “갑”은 별첨1. 및 별첨3.에서 정한 사양에 부합하는 계약제품의 전체
      구매량을 “을”로부터 구매하여야 할 의무가 있으며, “갑”과 “을” 중 어느
      하나가 전체 구매량 등의 구매조건의 변경을 요청할 시 상호 합의하여 서면으로
      변경할 수 있다. <br />
      (3) 별첨1. 내지 별첨3.에 규정되어 있지 않은 계약제품 거래 관련 사항은
      “갑”과 “을”이 합의하여 정한다. <br />
      (4) 본 계약 체결 이후 “갑”이 계약제품의 전부 또는 일부에 대하여 공급받고자
      하는 경우, 별첨2. 주문서에 구체적인 수량, 계약금액 등을 기재하여 “을”에게
      교부하여야 하며, “을”은 주문서를 수령한 날로부터 [*]일 이내에 “갑”에게
      주문서를 수령하였음을 통지하여야 한다. <br />
      (5) 본 계약 체결 이후 정기적으로 원활한 거래가 지속된다고 “을”이 판단하는
      경우, “갑”과 “을”은 본 계약에 갈음하여 별첨3.의 견적서를 작성하는 방식으로
      계약을 체결하고 제품을 거래할 수 있다. 이 경우, 당사자가 별도 합의하지
      않는 한, 본 계약의 내용이 준용된다. <br />
      제5조 [계약제품의 납품] <br />
      (1) “을”은 납기 내에 계약제품을 “갑”이 정하는 인도장소에 납품하여야 하며,
      “갑”이 필요에 의하여 분할 인도를 요구하는 경우를 제외하고는 계약제품을
      분할하여 납품할 수 없다. <br />
      (2) “을”은 지정된 납품일 내에 납품이 불가능한 경우, 사전에 구체적인 사유
      및 납품 예정일을 명시한 서면을 “갑”에게 제시한 후 “갑”의 동의를 얻어
      납품일자를 연장할 수 있다. <br />
      (3) “을”은 계약제품의 품질, 표시사항, 배송설비, 재활용, 폐기물처리 등에
      관한 제법령을 준수하여야 하며, 이를 위반함에 따른 모든 책임을 부담한다.{" "}
      <br />
      (4) 계약물품의 납품에 따르는 비용은 “을”의 부담으로 한다. 다만, “갑”이
      특별한 포장, 수송, 작업을 요청할 경우 그에 따른 추가 비용은 “갑”의
      부담으로 한다. <br />
      (5) “갑”은 “을”이 계약물품을 납품하면 제8조에 따라 검사를 마친 후 다음 각
      호의 어느 하나에 해당하는 경우를 제외하고는 “을”이 본 계약에 따라 납품하는
      계약물품을 지체 없이 수령한다. <br />
      1. 계약물품이 “을”의 귀책사유로 인하여 멸실, 훼손, 도난, 가치감소된 경우{" "}
      <br />
      2. 계약물품이 별첨1.의 사양 명세와 다른 경우 <br />
      3. 계약물품에 하자가 있는 경우 <br />
      4. 그 밖에 제1호부터 제3호까지의 규정에 준하는 사유로 “갑”이 계약상품의
      수령을 지체하거나 거부할 수 있는 정당한 사유가 있는 경우 <br />
      제6조 [위험부담, 압류/가압류, 사용 설명 등] <br />
      (1) 계약제품의 인도 전까지 계약제품의 전부 또는 일부의 멸실, 훼손, 도난 및
      가치감소가 있는 경우, 그 위험은 “갑”의 귀책사유가 있는 경우를 제외하고는
      “을”의 부담으로 하며, 계약제품의 인도 후에 발생한 위험은 그 원인이 “을”의
      귀책사유가 있는 경우를 제외하고는 “갑”이 이를 부담한다. <br />
      (2) “갑”이 요구하는 경우 또는 계약제품의 성질상 사용을 위한 설명이
      필요하고 취급에 따른 주의가 필요하다고 인정되는 경우, “을”은 계약제품의
      인도와 동시에 “갑”에게 계약제품의 사용, 보관 등의 요령과 주의사항을 명시한
      사용설명서 및 취급주의서를 제공하여야 한다. <br />
      제7조 [보증] “을”은 계약제품을 공급함에 있어 다음의 각호와 같이 보증한다.
      1. 계약제품은 “을”이 “갑”에게 제시한 사양, 명세 및 별첨1.과 일치한다.{" "}
      <br />
      2. 계약제품은 위탁자에게 배송받은 그대로 배송된 것임을 확인한다. <br />
      3. “을”은 본 계약에 따른 계약제품의 제공이 “을”에게 효력이 있는 모든 계약,
      합의와 상충, 불일치하거나 그 불이행이나 위반을 구성하지 아니함을 보증한다
    </div>
  );
};

export default ContractPaper;
